from pyecharts import options as opts
from pyecharts.charts import Geo

# 链式调用
c = (
    Geo()
        .add_schema(maptype="china")
        .set_global_opts(title_opts=opts.TitleOpts(title="阿云嘎30岁生日应援地图"))
)

class Point:
    def __init__(self, x, y, loc, desc):
        self.x = x
        self.y = y
        self.loc = loc
        self.desc = desc


kuaidigui = [
    Point(36.1198100000,120.3500930000,"青岛市北区、崂山区、李沧区、黄岛区","部分丰巢快递柜"),
    Point(28.1898810000,112.9074820000,"湖南省长沙市岳麓区梅溪湖","丰巢快递柜"),
    Point(41.7148200000,123.4497200000,"辽宁省沈阳市浑南区","部分丰巢快递柜"),
    Point(31.4880900000,120.2732500000,"无锡市江南大学星光广场","丰巢快递柜"),
    Point(31.2202400000,121.4239400000,"上海市长宁区","全部快递柜"),
    Point(31.2316200000,121.4846100000,"上海黄浦区","全部快递柜"),
    Point(39.9285500000,116.4163700000,"北京东城区","全部快递柜开屏"),
     Point(39.9219101073,116.4435596893,"北京朝阳区","全部快递柜"),
    Point(39.9123100000,116.3661100000,"北京西城区","丰巢开屏"),
    Point(23.1290100000, 113.2668000000, "广州越秀区", "465台"),
    Point(30.6014700000, 114.2709600000, "武汉江汉区", "366台"),
    Point(40.7919500000, 111.7017100000, "呼和浩特赛罕区", "465台"),
    Point(34.7482100000, 113.6133200000, "河南省郑州市中原区", "574个丰巢快递柜"),
    Point(23.1246300000, 113.3619900000, "广州天河区", "29台"),
    Point(29.5409800000, 106.4577300000, "重庆沙坪坝区", "310台"),
    Point(39.9593300000, 116.2984500000, "北京 海淀区 北舞", "丰巢开屏"),
    Point(30.6561800000, 104.0832900000, "成都锦江区", "全部丰巢开屏"),
    Point(23.0501300000, 113.3898600000, "广州番禺大学城", "丰巢开屏"),
    Point(21.2662400000, 110.3653400000, "湛江市赤坎区", "丰巢开屏"),
    Point(22.8149872200, 108.3613089400, "广西 南宁市区", "100台丰巢开屏"),
    Point(34.3412700000, 108.9398400000, "陕西省西安市碑林区 莲湖区 雁塔区 新城区 未央区 长安区", "丰巢开屏")]

gongyi = [
    Point(30.6108800000,104.0405600000,"成都市心爱星儿童能力训练中心","川渝云朵公益应援"),
    Point(28.8138700000,115.9495500000,"江西赣江","公益图书馆"),
    Point(28.8717000000,105.4425700000,"四川泸州","公益图书馆"),
    Point(31.2120950000, 121.4622630000, "上汽上海文化广场", "蒙古族原创民族舞剧《骑兵》"),
          Point(24.1199600000, 115.7358200000, "兴宁市阳光义工协会", "爱在康园"),
          Point(25.0207920000, 102.7081650000, "昆明环城南路668号云纺综合楼3楼云纺剧场", "话剧：《只想和你一样》"),
          Point(40.8251670000, 111.6876330000, "内蒙古呼和浩特地区", "公益教室"),
          Point(41.8546300000, 113.1346600000, "内蒙古乌兰察布市土牧尔台镇", "为912户居民捐赠路灯89座"),
          Point(38.6117000000, 105.6202410000, "腾格里锁边林", "捐赠10230元"),
          Point(38.8515300000, 105.7289800000, "阿拉善SEE公益机构", "一亿棵梭梭-项目捐赠10230元"),
          Point(41.0451740000, 108.3972560000, "内蒙古五原县胜丰中心学校", "公益图书角"),
          Point(32.0921150000, 118.6747540000, "南京平安阿福流浪动物救助中心", "捐赠救助善款1023元"),
          Point(41.3138100000, 117.7389700000, "河北省承德市隆化县", "一对一捐助留守儿童"),
          Point(39.6084500000, 109.7808700000, "内蒙古鄂尔多斯", "爱助事实孤儿2000元"),
          Point(27.1152028600, 103.3800777600, "云南省昭通市龙头山镇", "1对1助养失依女童一名 资助款1800元"),
          Point(33.0645700000, 115.2581100000, "安徽省阜阳市临泉", "贫困尖子生助学计划 11名"),
          Point(41.6997633127, 110.4398064223, "内蒙古生态锁边林", "中国绿化基金会-百万森林计划"),
          Point(37.3763400000, 101.6097800000, "青藏高原 三江源", "守护七亿人的水源地-公益项目捐赠善款1023元"),
          Point(29.1391000000, 109.0436600000, "重庆市县车田乡", "中国福利基金会-爱小丫-项目 1对1助养失依女童一名 资助款1500元"),
          Point(25.0307240000, 121.5200760000, "台北中华育幼机构儿童关怀协会", "捐赠等家宝宝水果箱5箱"), ]

touping = [
    Point(31.2031980000,121.5593390000,"上海龙阳路地铁站","10.22-10.24 10米LED炫动环幕"),
    Point(31.2097090000, 121.5191570000, "上海地铁1-13号线", "10月21-23日全线站点、站台、车厢移动媒体有声视频"),
           Point(29.5413610000, 106.5222470000, "重庆大坪时代天街", "LED大屏"),
           Point(30.2733130000, 120.1573050000, "杭州市环城北路纳德酒店", "应援大屏"),
           Point(36.0874300000, 120.3747900000, "青岛市市北区台东三路步行街", "投屏十块"),
           Point(39.9010310000, 116.4185250000, "北京崇文门", "搜秀大屏"),
           Point(39.9350000000, 116.4543600000, "北京三里屯", "全天五柱十屏楼身大屏"),
           Point(31.2029960000, 121.5573570000, "上海龙阳路", "全天十米炫动大屏"),
           Point(39.9101020000, 116.4715830000, "北京 国贸CBD", "21块屏组全天投放"),
           Point(22.6093900000,114.0293780000 ,"深圳北站/东站地铁站", "10月23日21个全幅LED包柱生日贺图"),
           Point(28.2366120000,113.0551340000, "长沙世界之窗", "摩天轮"),
           Point(30.1693500000, 120.2342500000, "杭州地铁一号线", "19站32块投屏"),
           Point(31.2234400000, 121.4453000000, "上海 静安寺/徐家汇/陆家嘴", "三大地铁商圈连续五天 生日贺图广告灯箱应援"),
           Point(31.2320930000, 121.4785940000, "上海 静安/黄埔/卢湾", "10月21至23日33块商务楼大堂LCD屏每日300次轮播"),
           Point(23.0367380000, 113.1542460000, "广东 佛山南海万科广场", "10月22日23日两天楼体大屏幕每天滚动播放110次以上"), ]

yingyuanwu = [Point(31.1959500000, 121.4396800000, "上海衡山路 5 space coffee", "阿云嘎生日快乐咖啡杯套1500份"),
              Point(40.0469600000, 116.5889500000, "首都东航机场", "登机牌")]

for i in kuaidigui:
    c.add_coordinate(i.loc, i.y, i.x)
for i in touping:
    c.add_coordinate(i.loc, i.y, i.x)

for i in gongyi:
    c.add_coordinate(i.loc, i.y, i.x)
for i in yingyuanwu:
    c.add_coordinate(i.loc, i.y, i.x)

c.add("快递柜", [(i.loc, i.desc) for i in kuaidigui], symbol_size=6, itemstyle_opts=opts.ItemStyleOpts(color="#567AAA"))
c.add("公益", [(i.loc, i.desc) for i in gongyi], symbol_size=12, itemstyle_opts=opts.ItemStyleOpts(color="green"))
c.add("投屏", [(i.loc, i.desc) for i in touping], symbol_size=8,itemstyle_opts=opts.ItemStyleOpts(color="#C2450A"))
c.add("应援物", [(i.loc, i.desc) for i in yingyuanwu], symbol_size=8, itemstyle_opts=opts.ItemStyleOpts(color="orange"))
print("快递柜：", len(kuaidigui))
print("应援物：", len(yingyuanwu))
print("公益：", len(gongyi))
print("投屏：", len(touping))
print("合计：", len(kuaidigui) + len(yingyuanwu) + len(gongyi) + len(touping))

c.set_series_opts(label_opts=opts.LabelOpts(is_show=False))

# 在 html(浏览器) 中渲染图表
c.render()

